---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.FireProtection
source: html/92b24bd6-c486-6feb-eb16-ee1021e5a19d.htm
---
# Autodesk.Revit.DB.GroupTypeId.FireProtection Property

Fire Protection.

## Syntax (C#)
```csharp
public static ForgeTypeId FireProtection { get; }
```